#+TITLE: parglare parser
#+SUBTITLE: 
#+EXPORT_FILE_NAME: index.html
#+SETUPFILE: ../../courses-startup.org

** Parsiranje sa LR parserom

#+BEGIN_SRC python :session intro :results output
from parglare import Parser, Grammar
g = Grammar.from_string(grammar)
parser = Parser(g, actions=actions)

result = parser.parse("2 * 3 + 4 / 2 / 2")

print("Result = ", result)

#+END_SRC

#+RESULTS:
: Result =  14.0

#+REVEAL: split

- Gramatika je višeznačna jer parser ne zna za prioritete i asocijativnosti.
- Podrazumevano =Parser= klasa (LR parser) razrešava /Shift/Reduce/ konflikte
  tako što preferira /Shift/ operaciju (videti [[http://www.igordejanovic.net/parglare/stable/parser/#prefer_shifts][prefer_shifts]]).
- Ovo dovodi do evaluacije s desna na levo.

** Generalizovano parsiranje
   
- Zamenom =Parser= klase sa =GLRParser= dobijamo generalizovano parsiranje gde
  će u slučaju višeznačnosti biti kreirana sva stabla parsiranja.
- U slučaju gramatike aritmetičkih izraza dobićemo sva moguća rešenja.

#+BEGIN_SRC python :session intro :results output
from parglare import GLRParser, Grammar
g = Grammar.from_string(grammar)
parser = GLRParser(g, actions=actions)

result = parser.parse("2 * 3 + 4 / 2 / 2")

print("Result = ", result)
print("Broj interpretacija = ", len(result))
#+END_SRC

#+RESULTS:
: Result =  [2.5, 3.5, 4.0, 5.0, 3.5, 10.0, 14.0, 10.0, 7.0, 8.0, 14.0, 14.0, 5.0, 3.5]
: Broj interpretacija =  14

#+ATTR_REVEAL: :frag (roll-in)
- Broj interpretacija je [[https://en.wikipedia.org/wiki/Catalan_number][Katalanov broj]] od =n= gde je =n= broj binarnih
  operacija u izrazu.
  #+BEGIN_SRC
1, 2, 5, 14, 42, 132, 429, 1430, 4862, 16796, 58786, 208012, 742900, 2674440...
  #+END_SRC

** Deklarativno razrešavanje višeznačnosti
   
- Deklarativno razrešavanje višeznačnosti obavljamo unutar ={}= koje navodimo po produkciji.
- Za asocijatinost koristimo ključne reči =left= (odnosno =reduce=) i =right=
  (odnosno =shift=).

#+BEGIN_SRC python :results none :session intro
grammar = r"""
S: E EOF;
E: E '+' E {left}
 | E '-' E {left}
 | E '*' E {left}
 | E '/' E {left}
 | '(' E ')'
 | number;

terminals
number: /\d+(\.\d+)?/;
"""
#+END_SRC

#+REVEAL: split

#+BEGIN_SRC python :session intro :results output
from parglare import GLRParser, Grammar
g = Grammar.from_string(grammar)
parser = GLRParser(g, actions=actions)

result = parser.parse("2 * 3 + 4 / 2 / 2")

print("Result = ", result)
#+END_SRC

#+RESULTS:
: Result =  [2.5]

- Sada parser dolazi do jednog rešenja ali pogrešnog tako što evaluaciju radi s
  leva na desno ne uzimajući u obzir prioritet (preferira /Reduce/ operaciju
  koja znači levu asocijativnost).
- Potrebno je definisati prioritete operacija!
 
** Prioriteti
   
#+BEGIN_SRC python :results none :session intro
grammar = r"""
S: E EOF;
E: E '+' E {left, 1}
 | E '-' E {left, 1}
 | E '*' E {left, 2}
 | E '/' E {left, 2}
 | '(' E ')'
 | number;

terminals
number: /\d+(\.\d+)?/;
"""
#+END_SRC

#+BEGIN_SRC python :session intro :results output
from parglare import GLRParser, Grammar
g = Grammar.from_string(grammar)
parser = GLRParser(g, actions=actions)

result = parser.parse("2 * 3 + 4 / 2 / 2")

print("Result = ", result)
#+END_SRC

#+RESULTS:
: Result =  [7.0]

- Sada je rezultat ispravan.

*** =calc= parser
    
#+BEGIN_SRC python :session intro :results none
grammar = r"""
S: E EOF;
E: E '+' E {left, 1}
 | E '-' E {left, 1}
 | E '*' E {left, 2}
 | E '/' E {left, 2}
 | '(' E ')'
 | number;

terminals
number: /\d+(\.\d+)?/;
"""

actions = {
    "S": lambda _, nodes: nodes[0],
    "E": [lambda _, nodes: nodes[0] + nodes[2],
          lambda _, nodes: nodes[0] - nodes[2],
          lambda _, nodes: nodes[0] * nodes[2],
          lambda _, nodes: nodes[0] / nodes[2],
          lambda _, nodes: nodes[1],
          lambda _, nodes: nodes[0]],
    "number": lambda _, value: float(value),
}
#+END_SRC

#+REVEAL: split

#+BEGIN_SRC python :results output :session intro
from parglare import Parser, Grammar
g = Grammar.from_string(grammar)
parser = Parser(g, actions=actions)

result = parser.parse("2 * 3 + 4 / 2 / 2")

print("Result = ", result)
#+END_SRC

#+RESULTS:
: Result =  7.0

*** Pokretanje
    
#+BEGIN_SRC python :var __file__=(buffer-file-name) :session :results output

def main(debug=False):
    this_folder = os.path.dirname(__file__)
    g = Grammar.from_file(os.path.join(this_folder, 'robot.pg'),
                          debug=debug, debug_colors=True)
    parser = Parser(g, actions=action.all, debug=debug,
                    debug_colors=True)

    end_position = parser.parse_file(os.path.join(this_folder, 'program.rbt'))

    print("Robot stops at position: {}".format(end_position))


if __name__ == "__main__":
    main(debug=False)
#+END_SRC

#+RESULTS:
: Robot initial position set to: 3, 1
: Moving robot up for 4 steps.
: Moving robot left for 9 steps.
: Moving robot down for 1 steps.
: Moving robot right for 1 steps.
: Robot stops at position: (3, 1)

